*** 1.决策树超参调优
#+BEGIN_SRC python :results output :export code
from sklearn.datasets import make_moons
from sklearn.model_selection import train_test_split, GridSearchCV, RandomizedSearchCV
from sklearn.ensemble import VotingClassifier, BaggingClassifier, RandomForestClassifier, ExtraTreesClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import accuracy_score

X, y = make_moons( # 生成卫星数据集
    n_samples=10000, # 10000个实例，中等大小
    shuffle=True,
    noise=0.4,
    random_state=42
)
X_train, X_test, y_train, y_test = train_test_split( # 分离测试集
    X,
    y,
    test_size=0.2,
    random_state=42,
    #shuffle=True
)
stdscaler = StandardScaler() # 调用特征缩放器
#X_train = stdscaler.fit_transform(X_train) # 缩放特征

dt = DecisionTreeClassifier( # 创建决策树分类器
    criterion='gini' # 分裂标准为不纯度
)
grid_param = {
    'max_leaf_nodes': range(2, 100),
    #'max_depth': range(80),
    #'min_samples_leaf': range(50)
}
grid_search = GridSearchCV(
#grid_search = RandomizedSearchCV(
    dt,
    grid_param,
    cv=5,
    scoring='accuracy',
    verbose=1,
    n_jobs=-1,
)
grid_search.fit(X_train, y_train)
best_clf  = grid_search.best_estimator_
print(best_clf)
#best_clf.fit(X_train, y_train) # 不需要再训练，已经训练好了！
y_pred = best_clf.predict(X_test)
print(grid_search.best_params_, grid_search.best_score_, accuracy_score(y_pred, y_test))
#+end_src

#+RESULTS:
: Fitting 5 folds for each of 98 candidates, totalling 490 fits
: DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
:                        max_depth=None, max_features=None, max_leaf_nodes=23,
:                        min_impurity_decrease=0.0, min_impurity_split=None,
:                        min_samples_leaf=1, min_samples_split=2,
:                        min_weight_fraction_leaf=0.0, presort='deprecated',
:                        random_state=None, splitter='best')
: {'max_leaf_nodes': 23} 0.85925 0.8735

训练时交叉验证的精度为85.52%， 测试的精度为79.92%，显然存在过拟合的情况，需要正则化。
可以设置参数的上下限或进行剪枝！

用随机网格搜索后得到交叉验证精度0.8566666666666667，测试集精度0.8104。以上两个模型中，对训练集先进行了
缩放和集中，导致在测试集上的预测准确率下降，如果不进行特征缩放，结果为：{'max_leaf_nodes': 23} 0.85925 0.8735

*** 2.对比本章学到的分类器性能
#+BEGIN_SRC python :results output :export code
from sklearn.datasets import make_moons
from sklearn.model_selection import train_test_split
#import numpy as np
from sklearn.ensemble import VotingClassifier, BaggingClassifier, RandomForestClassifier, ExtraTreesClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC
from sklearn.tree import DecisionTreeClassifier
from sklearn.preprocessing import StandardScaler
from sklearn.metrics import accuracy_score
from sklearn.ensemble import AdaBoostClassifier, GradientBoostingClassifier

X, y = make_moons( # 生成卫星数据集
    n_samples=10000, # 10000个实例，中等大小
    #shuffle=True,
    noise=0.4,
    random_state=42
)
X_train, X_test, y_train, y_test = train_test_split( # 分离测试集
    X,
    y,
    test_size=0.2,
    random_state=42,
    #shuffle=True
)
stdscaler = StandardScaler() # 调用特征缩放器
#X_train = stdscaler.fit_transform(X_train) # 缩放特征
#help(LogisticRegression);exit(0)
log_clf = LogisticRegression(solver='sag', n_jobs=-1) # 创建逻辑回归
svc = SVC(kernel='rbf') # 创建支持向量机分类器，高斯核
dt = DecisionTreeClassifier( # 创建决策树分类器
    #min_samples_leaf=5, # 节点最小实例数为5
    max_leaf_nodes=23, # 最大
    criterion='gini' # 分裂标准为不纯度
)
rdf_clf = RandomForestClassifier( # 创建随机森林分类器
    #min_samples_leaf=5, # 最小节点实例数为5
    max_leaf_nodes=23, # 最大叶节点数量
    criterion='gini', # 分裂标准为不纯度
    n_estimators=500, # 集成个数
    n_jobs=-1 # 全内核并行
    #max_samples=0.5, # 没有这一参数
)
vt_clf = VotingClassifier( # 创建投票分类器（集成方法）
    estimators=[('log', log_clf), ('dt', dt), ('rdf', rdf_clf)],
    voting='soft', # 软投票
    n_jobs=-1 # 使用全部内核
)
bg1_clf = BaggingClassifier( # 创建自助法分类器（集成方法）
    dt, # 基础预测器为决策树分类器
    bootstrap=True, # 抽样放回，bagging
    max_samples=0.5, # 每次抽样最大数比例
    n_estimators=500, # 集成树的个数
    oob_score=True, # 开启外包评估
    n_jobs=-1 # 使用所有内核
)
bg2_clf = BaggingClassifier(
    dt,
    bootstrap=False, # 抽样不放回，pasting
    max_samples=0.5,
    n_estimators=500,
    n_jobs=-1
)
#help(RandomForestClassifier)
ex_clf = ExtraTreesClassifier( # 创建极端随机树集成
    #min_samples_leaf=5,
    max_leaf_nodes=23, # 最大叶节点数量
    criterion='gini',
    n_estimators=500,
    n_jobs=-1
    #max_samples=0.5, # 没有这一参数
)
ada_clf = AdaBoostClassifier( # 创建自适应提升集成
    dt, # 被集成的基础预测器
    #DecisionTreeClassifier(max_depth=2),
    n_estimators=500, # 基础预测器的数量
    algorithm='SAMME.R', # 使用概率聚合而不使用类别
    learning_rate=0.2, # 学习率，用来对每个基础预测器的贡献进行缩放
    #n_jobs=-1 # 没有这一参数，依序学习，不能并行
)
gb_clf = GradientBoostingClassifier(
    n_estimators=500, # 基础预测器的数量
    #algorithm='SAMME.R', # 没有这一参数
    learning_rate=0.2, # 学习率，用来对每个基础预测器的贡献进行缩放
    subsample=0.5 # 随机梯度提升
)

clfs = (log_clf, svc, dt, vt_clf, bg1_clf, bg2_clf, rdf_clf, ex_clf, ada_clf, gb_clf)
#clfs = (gb_clf)
def validation(clfs, X, y): # 怎么评估不同模型的性能？
    scores = []
    for clf in clfs:
        clf.fit(X, y)
        #try:
        #    print(clf.__class__.__name__, clf.oob_score_)
        #except:
        #    pass
        #finally:
        #    try:
        #        print(clf.__class__.__name__, clf.feature_importances_)
        #    except:
        #        pass
        y_pred = clf.predict(X_test)
        acc_score = accuracy_score(y_pred, y_test)
        scores.append([clf.__class__.__name__, acc_score])
    return scores

scores = validation(clfs, X_train, y_train)
[print(x) for x in scores]
#+END_SRC

#+RESULTS:
#+begin_example
['LogisticRegression', 0.8415]
['SVC', 0.874]
['DecisionTreeClassifier', 0.8735]
['VotingClassifier', 0.871]
['BaggingClassifier', 0.8715]
['BaggingClassifier', 0.8675]
['RandomForestClassifier', 0.87]
['ExtraTreesClassifier', 0.869]
['AdaBoostClassifier', 0.841]
['GradientBoostingClassifier', 0.851]
#+end_example

运行结果：
#+BEGIN_EXAMPLE
['LogisticRegression', 0.8415]
['SVC', 0.874]
['DecisionTreeClassifier', 0.8735]
['VotingClassifier', 0.8715]
['BaggingClassifier', 0.8715]
['BaggingClassifier', 0.8705]
['RandomForestClassifier', 0.8725]
['ExtraTreesClassifier', 0.869]
['AdaBoostClassifier', 0.8415]
['GradientBoostingClassifier', 0.8615]
#+END_EXAMPLE
